{"date": "2023-10-01", "content": "Warren Buffett Is Selling Shares of This High-Yield Dividend Stock and, Likely, Buying Shares of His Favorite Stock (No, Not Apple!); Wall St Week Ahead-US stock market's powerhouses tested by soaring bond yields; What Warren Buffett learned from his past investment mistakes, including IBM and airlines; A Berkshire Hathaway holding with a nearly 4% yield is being pared down. Meanwhile, the Oracle of Omaha is probably piling ...; NEW YORK, Sept 29  -\n              Surging bond yields are rattling U.S. stocks, and some\ninvestors worry the richly valued shares of giant technology...; Warren Buffett is arguably the world's most celebrated investor. One trait that led him there is the fact that he's not afraid to admit to mistakes.; Warren Buffett Is Selling Shares of This High-Yield Dividend Stock and, Likely, Buying Shares of His Favorite Stock (No, Not Apple!)\n\nA Berkshire Hathaway holdi...; NEW YORK, Sept 29 (Reuters) -\n\nSurging bond yields are rattling U.S. stocks, and some investors worry the richly valued shares of giant technology and growth co...; Warren Buffett is arguably the most celebrated investor of all time, and one trait that helped land him there is the fact that he's not afraid to admit to mista..."}
{"date": "2023-10-02", "content": "Apple Stock: Seeing Potential Value (NASDAQ:AAPL); Wall Street Bulls Look Optimistic About Apple (AAPL): Should You Buy?; Apple and 4 More Quality Stocks to Buy After the Selloff; Apple designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. Learn more on AAPL stock here.; The average brokerage recommendation (ABR) for Apple (AAPL) is equivalent to a Buy. The overly optimistic recommendations of Wall Street analysts make the effec...; High-quality names Apple, Amazon, Starbucks, Netflix, and JPMorgan are all in the discount bin after a brutal September. Here's why it's time to buy.; Nikada/iStock Unreleased via Getty Images\n\nApple Inc. (NASDAQ:AAPL) is arguably one of the largest tech names in the world now. From the humble Apple-1, the com...; Investors often turn to recommendations made by Wall Street analysts before making a Buy, Sell, or Hold decision about a stock. While media reports about rating...; The market has sold off, and some high-quality names look ripe for buying.\n\nThe S&P 500 index has dropped about 7% from its year high set in late July. The main..."}
{"date": "2023-10-03", "content": "Apple Stock Near All-Time High; Tops Growth Stocks Benchmark; Apple Stock Near All-Time High; Tops Growth Stocks Benchmark; Apple (AAPL) Stock Moves -0.78%: What You Should Know; Both earnings and sales growth improved last quarter for the consumer device maker. Meanwhile Apple stock is showing renewed strength.; Both earnings and sales growth improved last quarter for the consumer device maker. Meanwhile Apple stock is showing renewed strength.; In the latest trading session, Apple (AAPL) closed at $172.40, marking a -0.78% move from the previous day.; Apple (AAPL) investors are still waiting for a bounce in the tech behemoth's stock from the release of the iPhone 15, which went on sale on Sept. 22. Still, alt...; Apple (AAPL) investors are still waiting for a bounce in the tech behemoth's stock from the release of the iPhone 15, which went on sale on Sept. 22. Still, alt...; Apple (AAPL) closed at $172.40 in the latest trading session, marking a -0.78% move from the prior day. This move was narrower than the S&P 500's daily loss of ..."}
{"date": "2023-10-04", "content": "Apple Stock Downgraded On Slowing iPhone Sales, Lack Of Catalysts; CEO Tim Cook sells some Apple stock, bringing him $41.5 million; CEO Tim Cook sells some Apple stock, bringing him $41.5 million; Apple stock is likely to struggle amid lower iPhone upgrade rates and a lack of near-term catalysts, a Wall Street analyst says.; The head of Apple recently conducted a series of company stock sales worth tens of millions of dollars that appeared in a Securities and Exchange Commission fil...; The head of Apple recently conducted a series of company stock sales worth tens of millions of dollars that appeared in a Securities and Exchange Commission fil...; Apple (AAPL) stock is likely to struggle amid lower iPhone upgrade rates and a lack of near-term catalysts, a Wall Street analyst says.\n\nX\n\nKeyBanc Capital Mark...; The head of Apple recently conducted a series of company stock sales worth tens of millions of dollars.\n\nCEO Tim Cook's sales, which appeared in a Securities an...; The head of Apple recently conducted a series of company stock sales worth tens of millions of dollars.\n\nCEO Tim Cook's sales, which appeared in a Securities an..."}
{"date": "2023-10-05", "content": "Apple CEO Tim Cook just sold 13% of his stock for $42 million after taxes; Meta Quest 3 Is Coming: Is Meta Stock a Better Buy Than Apple?; Where Will Apple Stock Be in 10 Years?; Apple CEO Tim Cook received 511,000 shares this month for beating a three-year performance goal, and cashed them in for $88 million in gross proceeds.; Meta Platforms (NASDAQ: META), home of Facebook, Instagram, and WhatsApp, will have serious competition in the market for augmented-reality and virtual-reality ...; With shares up by almost 700% over the last decade, Apple (NASDAQ: AAPL) richly rewarded its long-term investors.  Let's explore how the company's strategy co...; Apple CEO Tim Cook just sold $88 million of his stock, earning about $41.5 million after taxes.\n\nThe iPhone maker's boss cashed in 13% of his stake, but still o...; Meta Platforms (NASDAQ: META), home of Facebook, Instagram, and WhatsApp, will have serious competition in the market for augmented-reality and virtual-reality ...; With shares up by almost 700% over the last decade, Apple (NASDAQ: AAPL) richly rewarded its long-term investors. Let's explore how the company's strategy could..."}
{"date": "2023-10-06", "content": "Apple Stock Needs a Win. Here Are 2 Big Ideas.; Apple Inc. (AAPL) Is a Trending Stock: Facts to Know Before Betting on It; Formula 1 stock could gain 10% if Apple gets media rights; Apple’s next earnings report is just a few weeks away. It’s likely to post a fourth consecutive quarter of year-over-year revenue declines.; Zacks.com users have recently been watching Apple (AAPL) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.; Formula 1 stock could gain 10% if Apple gets media rights - Citi; Over the broad sweep of time, it has never made sense to bet against Apple. Not too long ago, it became the first U.S. company to top $3 trillion in market valu...; Apple (AAPL) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influen...; Published Oct 06, 2023 08:21AM ET\n\n© Reuters. Citi upgrades Formula One (FWONA) to Buy following capital expense revisions\n\nFWONA -0.23% Add to/Remove from Wat..."}
{"date": "2023-10-07", "content": "TD Synnex Stock: Wait For Better Price Levels (NYSE:SNX); ‘T-bill and chill’ strategy challenges stock investors; Robert Kiyosaki Names Profitable Asset That May Spike Soon, BTC Weekly Chart Signals Possible Breakout to $40,000, SHIB Lead Teases 'Secret' AI Initiatives: Crypto News Digest by U.Today By U.Today; TD SYNNEX recently announced its Q3 FY23 results, with a decline in revenue due to lower demand in the Americas and Europe. Read more here.; Rise in bond yields means there are more alternatives to betting on the fortunes of the Magnificent Seven tech giants; Robert Kiyosaki Names Profitable Asset That May Spike Soon, BTC Weekly Chart Signals Possible Breakout to $40,000, SHIB Lead Teases 'Secret' AI Initiatives: Cry...; gremlin\n\nTD SYNNEX (NYSE:SNX) is a solutions aggregator for the IT ecosystem. Since my last report, the stock hasn't moved a lot; it is trading around the same ...; Jeffrey Gundlach, one of the biggest names in the bond world, is feeling sorry for “poor” stock investors. Bondholders may have been absolutely hammered ove...; Published Oct 07, 2023 12:30PM ET\n\n© Reuters Robert Kiyosaki Names Profitable Asset That May Spike Soon, BTC Weekly Chart Signals Possible Breakout to $40,000,..."}
{"date": "2023-10-08", "content": "A rare Apple downgrade — and the price move after — is why we don't market time; These Stocks Turned $10,000 Into $13 Million (or More) and Are Not Done Rising Yet; Tesla's Q3 flop; Netflix's price hike; Rivian's plunge: Weekly tech roundup; Trying to sell a stock with the intention of buying it back at a lower price is a difficult game.; Growth investors often lament that if they had just put $10,000 in one of the more successful tech giants, they would be millionaires today.  Three Fool contrib...; By Louis Juricic and Sarina Isaacs; This week's rare Wall Street downgrade of Apple (AAPL) is the perfect example of why we don't try to time the stock market. In a note to clients late Tuesday, K...; These Stocks Turned $10,000 Into $13 Million (or More) and Are Not Done Rising Yet\n\nGrowth investors often lament that if they had just put $10,000 in one of th...; By Louis Juricic and Sarina Isaacs\n\nInvesting.com -- Here is your weekly Pro Recap on the biggest headlines out of a big earnings week for tech: Tesla's miss an..."}
{"date": "2023-10-09", "content": "Apple (AAPL) Expands Apple TV+ Portfolio With World War II Drama; Dow Jones Slides 100 Points On Hamas Attack; Apple, Nvidia, Tesla Stock Sell Off; Apple (AAPL) Rises Higher Than Market: Key Facts; Apple (AAPL) is expanding Apple TV+ content with the unveiling of the first images of its upcoming World War II drama, Masters of the Air, beginning Jan 26, 202...; The Dow Jones dropped Monday after Hamas attacked Israel over the weekend. Apple, Nvidia and Tesla fell sharply.; In the most recent trading session, Apple (AAPL) closed at $178.99, indicating a +0.85% shift from the previous trading day.; Apple AAPL is expanding Apple TV+ content with the unveiling of the first images of its upcoming World War II drama, Masters of the Air. The nine-episode limite...; The Dow Jones Industrial Average briefly dropped 100 points Monday after Israel declared war in response to an unprovoked attack by Islamist militant group Hama...; Apple (AAPL) closed the most recent trading day at $178.99, moving +0.85% from the previous trading session. The stock outperformed the S&P 500, which registere..."}
{"date": "2023-10-10", "content": "Could Apple be a casualty of the DOJ suit targeting Google?; Will Apple (AAPL) Beat Estimates Again in Its Next Earnings Report?; Snap Inc. stock rises Tuesday, outperforms market; A Wall Street firm argued this week that if Alphabet were to lose a U.S. government antitrust lawsuit, browsing partner Apple could take a hit on profits.; Apple (AAPL) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next ...; Shares of Snap Inc. rose 2.44% to $8.82 Tuesday, on what proved to be an all-around favorable trading session for the stock market, with the NASDAQ Composite...; A Wall Street firm argued this week that if Alphabet (GOOGL) were to lose a U.S. government antitrust lawsuit targeting its search operations, browsing partner ...; Have you been searching for a stock that might be well-positioned to maintain its earnings-beat streak in its upcoming report? It is worth considering Apple (AA...; Shares of Snap Inc. SNAP, +2.44% rose 2.44% to $8.82 Tuesday, on what proved to be an all-around favorable trading session for the stock market, with the NASDAQ..."}
{"date": "2023-10-11", "content": "Insider Sell: Apple Inc's Senior Vice President, CFO Luca Maestri Sells 63,695 Shares; Insider Sell: Apple Inc's Senior Vice President, CFO Luca Maestri Sells 63,695 Shares; Is Apple Priced to Perfection Based on Current P/E?; On October 9, 2023, Luca Maestri, Senior Vice President and Chief Financial Officer of Apple Inc (NASDAQ:AAPL), sold 63,695 shares of the company.; On October 9, 2023, Luca Maestri, Senior Vice President and Chief Financial Officer of Apple Inc (AAPL), sold 63,695 shares of the company. This move is pa; Stocks Analysis by MarketBeat.com (Kate Stalter) covering: Apple Inc, Apple Inc DRC, Apple Inc BDR, BNP PARIBAS ARBITRAGE ISSUANCE BV Put 201.27 USD APPLE COMPU...; On October 9, 2023, Luca Maestri, Senior Vice President and Chief Financial Officer of Apple Inc (NASDAQ:AAPL), sold 63,695 shares of the company. This move is ...; On October 9, 2023, Luca Maestri, Senior Vice President and Chief Financial Officer of Apple Inc (AAPL, Financial), sold 63,695 shares of the company. This move...; AAPL +0.08% Add to/Remove from Watchlist\n\nApple has a relatively high Price-to-Earnings ratio of 30, which means it could be overvalued relative to revenue pote..."}
{"date": "2023-10-12", "content": "Hotter Consumer Inflation Will Test Stock Market Bulls' Trust In Market Mechanics - Apple (NASDAQ:AAPL); Navigating Market Uncertainty: Intrinsic Value of Apple Inc; Warren Buffett's Berkshire Hathaway has likely scored a 93% gain on Nubank stock this year, making the crypto-friendly bank its best performer; To gain an edge, this is what you need to know today.; In this article, we will take a look into Apple Inc's (AAPL) DCF analysis, a reliable and data-driven approach to estimating its intrinsic value. Instead of usi; Warren Buffett's company has notched big gains on Apple, Amazon, and Nubank this year, but other stocks like Coca-Cola and Kraft Heinz have slumped.; To gain an edge, this is what you need to know today.\n\nHotter Consumer Inflation\n\nPlease click here for a chart of SPDR S&P 500 ETF Trust SPY which represents t...; In this article, we will take a look into Apple Inc's (AAPL, Financial) DCF analysis, a reliable and data-driven approach to estimating its intrinsic value. Ins...; Berkshire Hathaway's best-performing stock this year is likely Nubank-owner Nu Holdings, up 93%.\n\nWarren Buffett's company invested in the Brazilian fintech bef..."}
{"date": "2023-10-13", "content": "Apple CEO Tim Cook Just Sold $88 Million Worth of Stock. Has the Stock Peaked?; Apple (AAPL) Unveils Trailer of For All Mankind Season 4; Warren Buffett Relies On 8 Stocks Now That Apple Is Crumbling; According to a filing from Oct. 1, Apple (NASDAQ: AAPL) CEO Tim Cook exercised options on 511,000 shares of Apple stock which were valued at more than $88 milli...; Apple (AAPL) is expanding its Apple TV+ content with the upcoming launch of the fourth season of For All Mankind.; Warren Buffett's big-time faith in Apple is hurting Berkshire Hathaway now. Good thing he's got some other S&P 500 winners to count on.; According to a filing from Oct. 1, Apple (NASDAQ: AAPL) CEO Tim Cook exercised options on 511,000 shares of Apple stock which were valued at more than $88 milli...; Apple AAPL recently unveiled season four of the space drama, For All Mankind, at New York Comic Con. The iPhone maker is set to launch the latest season beginni...; Warren Buffett's big-time faith in Apple (AAPL) is hurting Berkshire Hathaway (BRKB) now. Good thing he's got some other S&P 500 winners to count on.\n\nX\n\nEight ..."}
{"date": "2023-10-14", "content": "Where Will Apple Stock Be in 3 Years?; How Huawei’s Stock Surge is Driving China’s Tech Boom.; ‘The Afterparty’: Netflix canceled the series after 2 seasons; What you need to know; It's hard to overstate how great of an investment Apple (NASDAQ: AAPL) has been.  Apple's flagship product represented nearly half of companywide sales in the m...; Huawei is one of the most successful and influential companies in the world, with a leading position in the fields of telecommunications, smartphones, cloud com...; \"The Afterparty\" was co-executively produced by Chris Miller and Phil Lord and stood out as a distinctive anthology series.; It's hard to overstate how great of an investment Apple (NASDAQ: AAPL) has been. Apple's flagship product represented nearly half of companywide sales in the mo...; Huawei is one of the most successful and influential companies in the world, with a leading position in the fields of telecommunications, smartphones, cloud com...; The Unique Appeal of \"The Afterparty\"\n\n\n\nCast:\n\n\n\nFAQs:\n\n\n\nAfter two seasons, fans of \"The Afterparty\" on Apple TV+ were left with a mix of emotions as the seri..."}
{"date": "2023-10-15", "content": "Rethinking The Apple Premium: A Financial Reality Check (NASDAQ:AAPL); Apple Inc. (NASDAQ:AAPL) is largely controlled by institutional shareholders who own 55% of the company; Single-stock ETFs versus CDRs: A comparison; Apple's market capitalization has reached $2.73 trillion, with 28% of this value added in 2022 alone. Find out why AAPL stock is a Sell.; Key Insights Institutions' substantial holdings in Apple implies that they have significant influence over the...; Both products offer fractional exposure to U.S. stocks, but they differ substantially from one another; Shahid Jamil\n\nThesis:\n\nApple (NASDAQ:AAPL) is the largest listed company in the world by market capitalization, standing tall at $2.73 trillion. 28% of this val...; Key Insights\n\nInstitutions' substantial holdings in Apple implies that they have significant influence over the company's share price\n\nThe top 25 shareholders o...; In the U.S., the first single-stock ETFs began trading in July 2022 after they received approval from the Securities and Exchange Commission. In Canada, the fir..."}
{"date": "2023-10-16", "content": "Apple (AAPL) Stock Sinks As Market Gains: What You Should Know; Apple stock falls on reports Huawei gaining bigger-than-expected market share in China By Investing.com; Morgan Stanley cuts Apple price target but doesn't see earnings as a material stock catalyst By Investing.com; In the closing of the recent trading day, Apple (AAPL) stood at $178.72, denoting a -0.07% change from the preceding trading day.; Apple stock falls on reports Huawei gaining bigger-than-expected market share in China; Morgan Stanley cuts Apple price target but doesn't see earnings as a material stock catalyst; In the latest trading session, Apple (AAPL) closed at $178.72, marking a -0.07% move from the previous day. This move lagged the S&P 500's daily gain of 1.06%. ...; Published Oct 16, 2023 06:46AM ET\n\n© Reuters. Apple (AAPL) stock falls on reports Huawei gaining bigger-than-expected market share in China\n\n1810 -0.48% Add to...; Published Oct 16, 2023 09:05AM ET\n\n© Reuters. Morgan Stanley cuts Apple (AAPL) price target but doesn't see earnings as a material stock catalyst\n\nAAPL -1.17% ..."}
{"date": "2023-10-17", "content": "Apple bonds are yielding more than 5%. The stock has a 0.5% dividend yield.; Apple bonds are yielding more than 5%. The stock has a 0.5% dividend yield.; Apple iPhone 15 availability improving; Investors are flocking to bonds issued by (almost all) of the Magnificent Seven companies, drawn in by the juiciest yields seen on such high-quality names.; Investors are flocking to bonds issued by (almost all) of the Magnificent Seven companies, drawn in by the juiciest yields seen on such high-quality names.; Apple iPhone 15 availability improving - BofA; Investors are flocking to bonds issued by (almost all) of the Magnificent Seven companies, drawn in by some of the juiciest yields seen on such high-quality nam...; Investors are flocking to bonds issued by (almost all) of the Magnificent Seven companies, drawn in by some of the juiciest yields seen on such high-quality nam...; Published Oct 17, 2023 09:15AM ET\n\n© Reuters. Apple (AAPL) iPhone 15 availability improving - BofA\n\nAAPL -1.28% Add to/Remove from Watchlist\n\nBofA analysts sai..."}
{"date": "2023-10-18", "content": "Apple Inc. (AAPL) is Attracting Investor Attention: Here is What You Should Know; Apple: Why I'm Losing Faith (Rating Downgrade) (NASDAQ:AAPL); Apple shares continue downward trend in volatile market By Investing.com; Apple (AAPL) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.; Apple's upcoming earnings report may reveal disappointing holiday quarter sales, particularly in China. Read more to see our analysis on AAPL stock.; Apple shares continue downward trend in volatile market; Apple (AAPL) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the nea...; Auris/iStock via Getty Images\n\nAs we get ready for earnings season to start ramping up, investors are very curious to see how the consumer is doing into this ye...; Published Oct 17, 2023 08:24PM ET Updated Oct 17, 2023 08:24PM ET\n\n© Reuters.\n\nAAPL -0.88% Add to/Remove from Watchlist GOOGL +0.45% Add to/Remove from Watchli..."}
{"date": "2023-10-19", "content": "Is Apple Stock a Buy Ahead of Earnings?; Apple investors face $340 billion hole as woes mount; Apple Investors Face $340 Billion Hole as Woes Mount; Tech giant Apple (NASDAQ: AAPL) will report results for its fiscal fourth quarter on Nov. 3.  Ahead of the report, many investors are likely wondering whether o...; Tepid sales in China for its new iPhone models have fueled concerns about Apples ability to justify its pricey valuation and avoid a streak of four consecutive ...; (Bloomberg) -- A drumbeat of bad news for Apple Inc. is casting doubt on the argument that the world’s most valuable company is immune to risks related to eco...; Tech giant Apple (NASDAQ: AAPL) will report results for its fiscal fourth quarter on Nov. 3. Ahead of the report, many investors are likely wondering whether or...; Bloomberg\n\nBloomberg\n\nBloomberg\n\nA drumbeat of bad news for Apple Inc. is casting doubt on the argument that the world’s most valuable company is immune to ri...; (Bloomberg) -- A drumbeat of bad news for Apple Inc. is casting doubt on the argument that the world’s most valuable company is immune to risks related to eco..."}
{"date": "2023-10-20", "content": "Apple Stock Falls Again. What’s Behind the Losing Streak.; Top Stock Reports for Apple, Amgen & Becton, Dickinson; Top Stock Reports for Apple, Amgen & Becton, Dickinson; The six-day streak is the longest since January 2022.; Today's Research Daily features new research reports on 12 major stocks, including Apple Inc. (AAPL), Amgen Inc. (AMGN) and Becton, Dickinson and Company (BDX).; Today's Research Daily features new research reports on 12 major stocks, including Apple Inc. (AAPL), Amgen Inc. (AMGN) and Becton, Dickinson and Company (BDX).; Apple stock fell for the sixth straight day on Friday.\n\nApple (ticker: AAPL) stock finished 1.5% lower at $172.88. This losing streak is the longest since Janua...; Friday, October 20, 2023\n\n\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports...; Friday, October 20, 2023\n\n\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports..."}
{"date": "2023-10-21", "content": "This Stock-Split Stock Is Beating Both Apple and Microsoft in 2023 -- With No Artificial Intelligence (AI) Tailwind at All; Big Nasdaq-100 Stocks Sell Off To Support Levels: Apple, NVIDIA, Tesla; Dow Jones Slumps 287 Points, Weighed Down By American Express; Tesla Violates Key Level; Apple (NASDAQ: AAPL) shares have soared close to 40%, while Microsoft (NASDAQ: MSFT) stock is up around 23%.  Investors' excitement about artificial intelligenc...; The major tech and social media components of the Nasdaq-100 got dumped this week as investors grappled with the meaning of even higher Treasury yields and the ...; The Dow Jones index fell sharply with other major stock indexes ahead of a busy week of high-profile earnings reports in the tech sector.; This Stock-Split Stock Is Beating Both Apple and Microsoft in 2023 -- With No Artificial Intelligence (AI) Tailwind at All\n\nApple (NASDAQ: AAPL) shares have soa...; Nasdaq 100 getty\n\nThe major tech and social media components of the Nasdaq-100 got dumped this week as investors grappled with the meaning of even higher Treasu...; Another wave of selling hit the stock market Friday as the Nasdaq composite breached the 13,000 level. Merck (MRK) was a top gainer in the Dow Jones Friday, but..."}
{"date": "2023-10-22", "content": "Is Elon Musk the Reason Warren Buffett Sold GM Stock?; Fed Focus, Loving + Hating Earnings Season, Bond/Stock Competition; A grim week for Nvidia and Tesla, but Netflix triumphs: Weekly tech roundup By Investing.com; Tesla (NASDAQ: TSLA) CEO Elon Musk and Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) CEO Warren Buffett are two of the wealthiest people in the world, and t...; Rob Isbitts and Matthew Tuttle discuss focusing on the Fed, Magnificent Seven earnings and why a little bullishness may be warranted.; A grim week for Nvidia and Tesla, but Netflix triumphs: Weekly tech roundup; Tesla (NASDAQ: TSLA) CEO Elon Musk and Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) CEO Warren Buffett are two of the wealthiest people in the world, and tita...; Maria Vonotna\n\nListen below or on the go on Apple Podcasts and Spotify\n\nRob Isbitts and Matthew Tuttle discuss focusing on the Fed, Magnificent Seven earnings a...; Published Oct 22, 2023 10:14AM ET\n\n© Reuters.\n\nNVDA -1.70% Add to/Remove from Watchlist NFLX -0.20% Add to/Remove from Watchlist TSLA -3.69% Add to/Remove from..."}
{"date": "2023-10-23", "content": "Apple stock falls as China woes continue By Investing.com; Apple (AAPL) Shares Pulled Back in Q3; Apple Stock: iPhone 15 Pro Models Demand Holds Steady, Lower-End Models See Lead Time Shifts; Apple stock falls as China woes continue; Aristotle Atlantic Partners, LLC, an investment advisor, released its “Large Cap Growth Strategy” third quarter 2023 investor letter. A copy of the same can...; There have been reports that iPhone 15 sales are not quite as strong as Apple (NASDAQ:AAPL) would have liked, particularly in key markets such as China. However...; Published Oct 23, 2023 06:36AM ET\n\n© Reuters. Apple (AAPL) stock falls as China woes continue\n\nAAPL -1.47% Add to/Remove from Watchlist\n\nApple (NASDAQ: ) share...; Aristotle Atlantic Partners, LLC, an investment advisor, released its “Large Cap Growth Strategy” third quarter 2023 investor letter. A copy of the same can...; There have been reports that iPhone 15 sales are not quite as strong as Apple (NASDAQ:AAPL) would have liked, particularly in key markets such as China.\n\nHoweve..."}
{"date": "2023-10-24", "content": "Competitor Analysis: Evaluating Apple And Competitors In Technology Hardware, Storage & Peripherals Industry - Apple (NASDAQ:AAPL); US Still Dominates The World's Largest Stock Exchanges; Big Tech Q3 Earnings: Top Questions for the CEOs of Google, Meta, Apple, Amazon; ; ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero; How is the antitrust trial going? What comes after the \"year of efficiency\"?; Loading... Loading... Loading...\n\nIn the dynamic and cutthroat world of business, conducting thorough company analysis is essential for investors and industry e...; Today, there are roughly 80 major stock exchanges worth a combined $110.2 trillion in value.\n\nThe world’s top two exchanges, the New York Stock Exchange (NYSE...; It’s going to be a busy Big Tech earnings week. Getty Images/Observer\n\nIt’s Big Tech earnings season, this year against the backdrop of a volatile stock mar..."}
{"date": "2023-10-25", "content": "Apple 'Scary Fast' Event: What We Expect; Apple shares fall as NASDAQ dips, contrasting Microsoft's rise By Investing.com; Almost Half of Warren Buffett's $333 Billion Portfolio Is Invested in Only 1 Stock; An M3 iMac is likely, but could new MacBooks also be coming?; Apple shares fall as NASDAQ dips, contrasting Microsoft's rise; Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) is a massive conglomerate that owns a sizable public equities portfolio.  Among the numerous holdings that the Wa...; You won't need to wait until Halloween to receive treats from Apple. The company is hosting a product launch event online on Monday, Oct. 30 at 5 p.m. PT (8 p.m...; Published Oct 25, 2023 06:50PM ET Updated Oct 25, 2023 06:50PM ET\n\n© Reuters.\n\nAAPL -1.36% Add to/Remove from Watchlist\n\nOn Wednesday, Apple Inc (NASDAQ: ).'s ...; Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) is a massive conglomerate that owns a sizable public equities portfolio. Among the numerous holdings that the War..."}
{"date": "2023-10-26", "content": "Apple Stock and Big Tech Went From Market Saviors to Market Destroyers; Masimo stock jumps after win in patent fight with Apple at Intl Trade Commission; 1 Simple Reason Warren Buffett Prefers to Buy Apple Rather Than Tesla Stock; Big Tech stocks were early winners this year, but they're slumping now due to a number of factors.; Masimo (MASI) stock surges 15% in after-hours trading following its victory over Apple (AAPL) at the U.S. International Trade Commission.; Apple (NASDAQ: AAPL) and Tesla (NASDAQ: TSLA) are two of the top companies in the world.  CEO Warren Buffett is a big fan of Apple and that's Berkshire's top ...; Earlier this year, Big Tech stocks were soaring, and pulling up the S&P 500. They’re dropping now, and taking the market a few rungs.\n\nThe S&P 500 had gained ...; Masimo (NASDAQ:MASI) soared 15% after hours trading after it won a fight with Apple (NASDAQ:AAPL) at the U.S. International Trade Commission. Apple ticked down ...; Apple (NASDAQ: AAPL) and Tesla (NASDAQ: TSLA) are two of the top companies in the world. CEO Warren Buffett is a big fan of Apple and that's Berkshire's top hol..."}
{"date": "2023-10-27", "content": "Up 34% This Year, Will Apple Stock Rally Further Following Q4 Results?; Masimo stock pares gain on Apple Watch patent victory; Pre-Earnings: is Apple a Buy, a Sell, or a Hold?; We expect earnings to stand at about $1.32 per share, slightly ahead of consensus estimates.; Masimo stock experiences a slight gain after winning a ban on certain Apple Watches in their patent battle, but Apple plans to appeal the decision.; iPhone sales, artificial intelligence advancement, and services will be key areas to watch in Apple’s earnings report; EDMONTON, CANADA - OCTOBER 25, 2023 : View of the Apple Store and logo inside a local Edmonton ... [+] shopping center, on Octobers 25, 2023, in Edmonton, Alber...; Masimo (NASDAQ:MASI) on Friday pared earlier gains of as much as 7% and rose 2% after winning a ban on importing some Apple Watches in its patent fight with the...; Apple (AAPL) shares are up 15% over the past 12 months. Ahead of its fiscal fourth-quarter earnings report next week, here's Morningstar’s take on what to loo..."}
{"date": "2023-10-28", "content": "Drop Apple Stock, As Overvaluation Won't Survive ~5% On Treasuries (NASDAQ:AAPL); Can Apple Stock Double in 5 Years? Here's What It Would Take.; Stocks To Watch: Fed Meeting, Earnings From Apple And AMD In Focus; Apple's high valuation compared to its growth trajectory is puzzling, but its consistent earnings and quality justify a premium. Read more here.; In the last five years, shares of Apple (NASDAQ: AAPL) have more than tripled.  Key to this outperformance has been strong financial performance, but investors ...; Stay informed of upcoming key events in the market through Seeking Alpha's Stocks to Watch newsletter.; primeimages\n\nThe Apple Safe-Haven Argument\n\nWhy are investors paying close to 30x earnings on Apple (NASDAQ:AAPL) stock, paying a 50-60% premium to the S&P 500 ...; In the last five years, shares of Apple (NASDAQ: AAPL) have more than tripled. Key to this outperformance has been strong financial performance, but investors c...; Get ahead of the market by subscribing to Seeking Alpha's Stocks to Watch, a preview of key events scheduled for the coming week. The newsletter keeps you infor..."}
{"date": "2023-10-29", "content": "Big Bank Bought Up Apple, Tesla, AT&T, and Microsoft Stock; Stock Traders Face Pivotal Week as Apple Steals Fed Spotlight; Stock Traders Face Pivotal Week as Apple Steals Fed Spotlight; The Czech National Bank raised its investments in shares of Apple, Tesla, AT&T, and Microsoft by about 50% in the third quarter.; (Bloomberg) -- A Federal Reserve meeting typically is the stock-market story of the week. Not so this time, however, as investors are more focused on Apple Inc....; (Bloomberg) -- A Federal Reserve meeting typically is the stock-market story of the week. Not so this time, however, as investors are more focused on Apple Inc....; The central bank of the Czech Republic recently increased investments in many U.S.-traded stocks.\n\nThe Czech National Bank added about 50% to investments in App...; (Bloomberg) -- A Federal Reserve meeting typically is the stock-market story of the week. Not so this time, however, as investors are more focused on Apple Inc....; (Bloomberg) -- A Federal Reserve meeting typically is the stock-market story of the week. Not so this time, however, as investors are more focused on Apple Inc...."}
{"date": "2023-10-30", "content": "Some Chinese Abandoning Apple, Stock Buying On No Response From Iran, All Eyes On Bank Of Japan - Apple (NASDAQ:AAPL); Fed Meeting, Apple Earnings And An Oversold Stock Market; Week Ahead: Fed Meeting, Apple Earnings and An Oversold Stock Market; To gain an edge, this is what you need to know today.; Looking at the fed funds probability picture, it’s clear the Fed / FOMC is on hold for now.; Market Overview Analysis by Brian Gilmartin covering: S&P 500, Apple Inc, US Dollar Index Futures, Crude Oil WTI Futures. Read Brian Gilmartin's latest article ...; Loading... Loading... Loading...\n\nTo gain an edge, this is what you need to know today.\n\nBuying On Iran, Ignoring Apple\n\nPlease click here for a chart of Apple ...; TERADAT SANTIVIVUT\n\nThe first bar chart is the fed funds probability for Wednesday’s 11/1/23 FOMC meeting and what it’s telling readers is that there is a 9...; US500 -0.48% Add to/Remove from Watchlist AAPL +0.80% Add to/Remove from Watchlist DX +0.11% Add to/Remove from Watchlist CL -1.84% Add to/Remove from Watchlist..."}
{"date": "2023-10-31", "content": "Analyzing Apple (AAPL) Stock Before Earnings; Time to Buy Apple (AAPL) or Qualcomm's (QCOM) Stock as Earnings Approach?; Apple: Spooky Quarter Ahead (NASDAQ:AAPL); Although Apple (AAPL) is poised for robust growth in the long run, driven by its strategic leadership and innovative product lineups, its near-term performance ...; Investors will certainly be hoping these iconic tech partners can post strong quarterly results that give both of their stocks a boost.; Apple Inc. is expected to report another negative quarter with FQ4'23 sales down nearly 1%. Find out why AAPL stock is a Sell.; Although Apple (AAPL) is poised for robust growth in the long run, driven by its strategic leadership and innovative product lineups, its near-term performance ...; After renewing their partnership earlier in the year, Wall Street will certainly be scoping Qualcomm (QCOM) and Apple’s (AAPL) quarterly reports this week.\n\nP...; mphillips007/iStock via Getty Images\n\nApple Inc. (NASDAQ:AAPL) reports key FQ4'23 results after the close on November 2. The company guided to a fourth consecut..."}
